InformationRegisters/СведенияОПользователяхСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПользователяхСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОповеститьОбИзменении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОПользователяхСервиса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьЗапись(ТекущийПользователь, ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПользователяСервиса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ТекущийПользователь,
		"ИдентификаторПользователяСервиса");
	
	Если Не ЗначениеЗаполнено(ИдентификаторПользователяСервиса) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СведенияОПользователяхСервиса");
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторПользователяСервиса", ИдентификаторПользователяСервиса);
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		
		Записывать = Ложь;
		
		ЗаписьРегистра = СоздатьМенеджерЗаписи();
		ЗаписьРегистра.ИдентификаторПользователяСервиса = ИдентификаторПользователяСервиса;
		ЗаписьРегистра.Прочитать();
		
		Если Не ЗаписьРегистра.Выбран() Тогда
			ЗаписьРегистра.ИдентификаторПользователяСервиса = ИдентификаторПользователяСервиса;
			Записывать = Истина;
		Иначе
			
			Для Каждого ЭлементПараметр Из ПараметрыЗаписи Цикл
				
				Если ЗаписьРегистра[ЭлементПараметр.Ключ] <> ЭлементПараметр.Значение Тогда
					Записывать = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Записывать Тогда
			
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ПараметрыЗаписи);
			ЗаписьРегистра.ОповеститьОбИзменении = Истина;
			ЗаписьРегистра.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
